{
  "https://www.cnn.com/2025/11/01/politics/trump-pentagon-nigeria-action": {
    "url": "https://www.cnn.com/2025/11/01/politics/trump-pentagon-nigeria-action",
    "summary": "US President Donald Trump ordered the Defense Department to prepare for possible military action in Nigeria, accusing the nation of widespread violence against Christians and an \"existential threat\" to Christianity. He threatened to halt all US aid and deploy forces \"guns-a-blazing\" to eliminate \"Islamic Terrorists\" if the Nigerian government doesn't quickly protect Christians, an order publicly supported by Defense Secretary Pete Hegseth.\n\nNigeria, through President Bola Ahmed Tinubu and his press secretary, vehemently denied Trump's accusations of religious intolerance, stating that violence affects both Christians and Muslims (often with more Muslim victims) and stems from various factors like farmer-herder clashes and communal tensions, not solely religious persecution. Nigeria instead requested US military support to combat extremists, arguing against the \"Country of Particular Concern\" designation (which the US had recently applied) and direct military intervention.",
    "translation": "美国总统唐纳德·特朗普下令国防部，为在尼日利亚采取可能的军事行动做准备，指责该国对基督徒进行普遍暴力，并称其对基督教构成“生存威胁”。他威胁称，如果尼日利亚政府不迅速保护基督徒，将停止所有美国援助，并“火力全开”部署部队以消灭“伊斯兰恐怖分子”。这一命令得到了国防部长皮特·赫格塞斯的公开支持。\n\n尼日利亚通过总统博拉·艾哈迈德·蒂努布及其新闻秘书，强烈否认了特朗普关于宗教不容忍的指控，声明称暴力影响基督徒和穆斯林双方（通常穆斯林受害者更多），且源于农牧民冲突和社区紧张关系等多种因素，而非仅仅是宗教迫害。尼日利亚反而请求美国提供军事支持以打击极端分子，反对将其指定为“特别关注国”（美国近期已施加此项指定）和直接军事干预。",
    "translation_lang": "Chinese"
  },
  "https://www.nbcnews.com/sports/mlb/live-blog/world-series-2025-dodgers-blue-jays-watch-game-7-live-updates-rcna241173": {
    "url": "https://www.nbcnews.com/sports/mlb/live-blog/world-series-2025-dodgers-blue-jays-watch-game-7-live-updates-rcna241173",
    "summary": "In Game 7 of the World Series, the Toronto Blue Jays currently lead the Los Angeles Dodgers 3-0 in the fourth inning.\n\nThe series is tied 3-3, making this a winner-take-all matchup. Future Hall of Famers Shohei Ohtani (Dodgers) and Max Scherzer (Blue Jays) are the starting pitchers. The Dodgers are aiming for a repeat championship, while the Blue Jays seek their first title since 1993.\n\nThe scoring began in the third inning when **Bo Bichette hit a 3-run homer** for the Blue Jays, following a George Springer single, a sacrifice bunt, a wild pitch by Ohtani, and an intentional walk to Vladimir Guerrero Jr.\n\n**Max Scherzer** has been dominant for Toronto, retiring nine consecutive batters through the third inning after giving up a leadoff single to Ohtani. His velocity is up, and he has only allowed one hit.\n\n**Shohei Ohtani** for the Dodgers, pitching on short rest for the first time in his career, showed good fastball velocity but struggled with his secondary pitches and command, allowing four baserunners in the first two innings before the third-inning homer. Dodgers manager Dave Roberts is being criticized for leaving Ohtani in the game too long given his clear struggles.\n\nBoth teams had leadoff hits in the first inning but failed to score. The Blue Jays also loaded the bases in an earlier inning but couldn't convert, largely due to Bo Bichette's knee injury preventing him from scoring.",
    "translation": "Aquí tienes la traducción al español:\n\nEn el Séptimo Partido de la Serie Mundial, los Toronto Blue Jays actualmente van ganando a los Los Angeles Dodgers 3-0 en la cuarta entrada.\n\nLa serie está empatada 3-3, lo que convierte a este en un encuentro de \"todo o nada\". Los futuros miembros del Salón de la Fama, Shohei Ohtani (Dodgers) y Max Scherzer (Blue Jays), son los lanzadores abridores. Los Dodgers buscan repetir el campeonato, mientras que los Blue Jays persiguen su primer título desde 1993.\n\nLas carreras llegaron en la tercera entrada cuando **Bo Bichette conectó un jonrón de 3 carreras** para los Blue Jays, luego de un sencillo de George Springer, un toque de sacrificio, un lanzamiento descontrolado de Ohtani y una base por bolas intencional a Vladimir Guerrero Jr.\n\n**Max Scherzer** ha estado dominante para Toronto, retirando a nueve bateadores consecutivos hasta la tercera entrada después de permitir un sencillo de Ohtani al inicio del partido. Su velocidad ha aumentado y solo ha permitido un imparable.\n\n**Shohei Ohtani**, de los Dodgers, lanzando con poco descanso por primera vez en su carrera, mostró buena velocidad en su recta, pero tuvo problemas con sus lanzamientos secundarios y el control, permitiendo cuatro corredores en base en las dos primeras entradas antes del jonrón en la tercera. El mánager de los Dodgers, Dave Roberts, está siendo criticado por mantener a Ohtani en el juego demasiado tiempo, dada su evidente dificultad.\n\nAmbos equipos tuvieron sencillos abridores en la primera entrada, pero no lograron anotar. Los Blue Jays también llenaron las bases en una entrada anterior, pero no pudieron capitalizar, en gran parte debido a la lesión de rodilla de Bo Bichette que le impidió anotar.",
    "translation_lang": "Spanish"
  },
  "https://www.cnn.com/2025/11/01/uk/andrew-sandringham-estate-explained-intl": {
    "url": "https://www.cnn.com/2025/11/01/uk/andrew-sandringham-estate-explained-intl",
    "summary": "Prince Andrew has been exiled by King Charles III to the Sandringham estate, a move resulting in the stripping of his royal titles and the requirement to surrender his lease on Royal Lodge. This action follows renewed scrutiny over his association with Jeffrey Epstein and claims by Virginia Giuffre, with King Charles acting to protect the monarchy's reputation.\n\nAndrew, who will now be known as Andrew Mountbatten Windsor, will move into an undisclosed property on the Sandringham estate. Sandringham, a private royal property for five generations and a cherished retreat for the late Queen Elizabeth II and King Charles, is a vast 20,000-acre estate with numerous residences like York Cottage, Gardens House, and The Folly, where Andrew could reside.\n\nThe relocation, privately financed by King Charles, is not immediate due to legal formalities. Andrew's ex-wife, Sarah Ferguson, will move out of Royal Lodge separately, and the late Queen's corgis will remain in the care of Andrew's family.",
    "translation": "video/output.mp4",
    "translation_lang": "ASL"
  }
}