{
  "https://www.cnn.com/2025/11/01/politics/obama-campaign-nj-virginia-election": {
    "url": "https://www.cnn.com/2025/11/01/politics/obama-campaign-nj-virginia-election",
    "summary": "Former President Barack Obama campaigned on Saturday for Democratic gubernatorial nominees Abigail Spanberger in Virginia and Mikie Sherrill in New Jersey, ahead of Tuesday's elections. Obama urged voters to break with President Donald Trump, delivering sharp criticism of Trump's administration, accusing it of weakening democratic norms, concentrating economic power, and exhibiting \"lawlessness and recklessness.\"\n\nObama emphasized the importance of these elections as a \"temperature check\" on the nation's political mood and a precursor for future midterms, stressing that \"elections do matter.\" Both Spanberger and Sherrill are favored in their respective races, though their victories are not guaranteed, and the outcomes are seen as significant indicators of the public's sentiment.",
    "translation": "video/output.mp4",
    "translation_lang": "ASL"
  },
  "https://www.cnn.com/travel/halloween-new-york-city-chance-encounters": {
    "url": "https://www.cnn.com/travel/halloween-new-york-city-chance-encounters",
    "summary": "While feeling lost and unhappy in New York City, Parisian Claire met David at a Halloween party in 2019. Despite initial doubts and geographical challenges (LA vs. Paris), their connection deepened through long-distance communication, pandemic-era quarantines with Claire's grandparents, and travel adventures. They eventually married in France in 2022 and settled in Los Angeles, grateful for the unwavering support and shared vision they found in each other.\n",
    "translation": "audio/translation_spanish_9be37fe82c.mp3",
    "translation_lang": "spanish",
    "translation_type": "Other"
  },
  "https://www.cnn.com/sport/live-news/world-series-dodgers-blue-jays-11-01-25": {
    "url": "https://www.cnn.com/sport/live-news/world-series-dodgers-blue-jays-11-01-25",
    "summary": "Los Dodgers de Los Ángeles ganaron la Serie Mundial 2025 en una dramática remontada en el Juego 7 contra los Azulejos de Toronto, asegurando su segundo título consecutivo. Toronto lideró inicialmente, pero los Dodgers fueron reduciendo la ventaja. Los momentos clave incluyeron un jonrón del empate de Miguel Rojas en la novena entrada y un jonrón de la ventaja de Will Smith en la undécima. Yoshinobu Yamamoto, nombrado Jugador Más Valioso de la Serie Mundial, cerró el juego para los Dodgers. El juego contó con múltiples cambios de liderazgo y jugadas claves de ambos equipos.",
    "translation": "audio/translation_spanish_9b1a523571.mp3",
    "translation_lang": "spanish",
    "translation_type": "Other"
  },
  "https://www.youtube.com/watch?v=8S0FDjFBj8o": {
    "url": "https://www.youtube.com/watch?v=8S0FDjFBj8o",
    "summary": "The speaker satirizes TED Talks by admitting upfront that they have nothing to say, yet will use common speaking techniques like hand gestures, personal anecdotes, and random data/graphs to create the illusion of insightful and impactful content. They highlight the absurdity of the formulaic approach, proving how easily an audience can be manipulated into believing they've learned something even when presented with utter nonsense. The speaker essentially demonstrates how to give a convincing talk without actually having anything to say.\n",
    "translation": "Other,audio/translation_spanish_e17810ca8c.mp3",
    "translation_lang": "spanish"
  },
  "https://www.youtube.com/watch?v=1lm4Wlpy2wU": {
    "url": "https://www.youtube.com/watch?v=1lm4Wlpy2wU",
    "summary": "To get a YouTube video transcript:\n\n1.  Open the YouTube video.\n2.  Click the three dots next to the like/dislike buttons.\n3.  Select \"Show transcript.\"\n4.  To copy the transcript, click the three vertical dots in the transcript window and select \"Toggle timestamps\" to remove them.\n5.  Select and drag to highlight the entire transcript, right-click, and copy.\n6.  Paste the transcript wherever you need it.\n",
    "translation": "video/output_d223cf4d97.mp4",
    "translation_lang": "ASL",
    "translation_type": "ASL"
  },
  "https://www.cnn.com/2025/11/01/us/portland-national-guard-deployment-trial": {
    "url": "https://www.cnn.com/2025/11/01/us/portland-national-guard-deployment-trial",
    "summary": "A federal judge is expected to rule soon on the legality of National Guard deployments to Portland to protect an ICE facility, after a trial highlighted the following key points:\n\n*   National Guard troops were deployed to the facility even after a judge issued a restraining order against it, raising questions of contempt.\n*   ICE officials were not consulted before Trump ordered the deployment.\n*   There's a disagreement on whether the protests are extreme enough to warrant the National Guard, with the city arguing local law enforcement can handle it and that federal tactics exacerbate the situation.\n*   Portland Police highlighted a different use of force from federal agents who deployed munitions when local law enforcement did not believe it necessary.\n*   The Trump administration argued the deployment is necessary due to the persistent and organized violence directed at the facility.\n*   Local officials claimed that National Guard was inflaming tensions and violating Oregon sovereignty.\n*   The decision is expected by Sunday and will likely be appealed.",
    "translation": "video/output_e74ef6b4e0.mp4",
    "translation_lang": "ASL",
    "translation_type": "ASL"
  },
  "https://www.cnn.com/2025/11/02/politics/democrats-shutdown-politics": {
    "url": "https://www.cnn.com/2025/11/02/politics/democrats-shutdown-politics",
    "summary": "CNN reports that Democrats are politically winning the current government shutdown, as polls show the public blames Trump and Republicans more, and Democrats' key policy demand (Obamacare subsidies) is popular. Republican actions, like firing federal workers and controversial comments about food stamps, seem to be backfiring. The shutdown also appears to be rallying Democrats. Consequently, the article suggests Democrats have little reason to concede and risk backlash from their base, especially given past criticism that they haven't fought hard enough against Trump. They may see the shutdown as an opportunity for more than just a moral victory.\n"
  },
  "https://devpost.com/hackathons": {
    "url": "https://devpost.com/hackathons",
    "summary": "Devpost es una plataforma para hackatones, que ofrece eventos tanto públicos como privados (específicos de la empresa). Ayuda a los desarrolladores a participar en hackatones y a las empresas a organizarlos, fomentando la innovación, la colaboración y la promoción de la plataforma. Recursos como blogs, historias de clientes, guías de planificación, seminarios web y un servicio de asistencia técnica están disponibles para apoyar experiencias de hackatón exitosas.",
    "translation": "audio/translation_spanish_ea99e118da.mp3",
    "translation_lang": "spanish",
    "translation_type": "Other"
  },
  "https://www.cnn.com/2025/11/02/uk/uk-train-attack-wwk-intl-gbr": {
    "url": "https://www.cnn.com/2025/11/02/uk/uk-train-attack-wwk-intl-gbr",
    "summary": "Un ataque con arma blanca masivo en un tren del Reino Unido que viajaba a Londres dejó a nueve personas con heridas que amenazan sus vidas, dos de ellas en estado crítico. Dos hombres nacidos en Gran Bretaña de unos 30 años fueron arrestados poco después del incidente, que ocurrió después de que el tren saliera de la estación de Peterborough. Los pasajeros describieron escenas de pánico y huida, con la policía respondiendo rápidamente y usando una pistola Taser para someter a un sospechoso. Si bien aún se está investigando el motivo, las autoridades dicen que no hay indicios de terrorismo. El Reino Unido rara vez ve eventos con muchas víctimas, pero los delitos con cuchillo han ido en aumento. Figuras clave, incluidos el Primer Ministro y el Rey Carlos, expresaron conmoción y ofrecieron sus condolencias.",
    "translation": "audio/translation_spanish_a18b7ce571.mp3",
    "translation_lang": "spanish",
    "translation_type": "Other"
  },
  "https://www.cnn.com/videos/title-2573150": {
    "url": "https://www.cnn.com/videos/title-2573150",
    "summary": "To continue watching, you need to choose your TV provider. The content is copyrighted by Cable News Network (CNN).\n"
  },
  "Jared": [
    {
      "type": "folder",
      "value": "created"
    },
    {
      "type": "url",
      "value": "https://www.cnn.com/sport/live-news/world-series-dodgers-blue-jays-11-01-25"
    },
    {
      "type": "url",
      "value": "https://www.msnbc.com/opinion/msnbc-opinion/sidney-reid-acquitted-ice-dc-rcna240605"
    }
  ],
  "Pratosh": {
    "urls": [],
    "files": []
  },
  "https://www.msnbc.com/opinion/msnbc-opinion/sidney-reid-acquitted-ice-dc-rcna240605": {
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/sidney-reid-acquitted-ice-dc-rcna240605",
    "summary": "Sidney Reid, a D.C. resident, recounts being arrested and charged by the Department of Justice (under U.S. Attorney Jeanine Pirro) for allegedly assaulting a federal agent while observing and recording outside a D.C. jail. Reid emphasizes that she was only documenting what was happening to detainees and their families. Despite three grand juries refusing to indict, the U.S. Attorney charged her with a misdemeanor. Reid was ultimately acquitted, but the experience put her life on hold for three months. She expresses outrage at the unfair prosecution and urges others to take action and defend their country. Her lawyers emphasized that this trial never should have happened.\n"
  }
}