{
  "https://www.cnn.com/2025/11/01/politics/obama-campaign-nj-virginia-election": {
    "url": "https://www.cnn.com/2025/11/01/politics/obama-campaign-nj-virginia-election",
    "summary": "Former President Barack Obama campaigned on Saturday for Democratic gubernatorial nominees Abigail Spanberger in Virginia and Mikie Sherrill in New Jersey, ahead of Tuesday's elections. Obama urged voters to break with President Donald Trump, delivering sharp criticism of Trump's administration, accusing it of weakening democratic norms, concentrating economic power, and exhibiting \"lawlessness and recklessness.\"\n\nObama emphasized the importance of these elections as a \"temperature check\" on the nation's political mood and a precursor for future midterms, stressing that \"elections do matter.\" Both Spanberger and Sherrill are favored in their respective races, though their victories are not guaranteed, and the outcomes are seen as significant indicators of the public's sentiment.",
    "translation": "video/output.mp4",
    "translation_lang": "ASL"
  },
  "https://www.cnn.com/travel/halloween-new-york-city-chance-encounters": {
    "url": "https://www.cnn.com/travel/halloween-new-york-city-chance-encounters",
    "summary": "While feeling lost and unhappy in New York City, Parisian Claire met David at a Halloween party in 2019. Despite initial doubts and geographical challenges (LA vs. Paris), their connection deepened through long-distance communication, pandemic-era quarantines with Claire's grandparents, and travel adventures. They eventually married in France in 2022 and settled in Los Angeles, grateful for the unwavering support and shared vision they found in each other.\n",
    "translation": "audio/translation_spanish_9be37fe82c.mp3",
    "translation_lang": "spanish",
    "translation_type": "Other"
  },
  "https://www.cnn.com/sport/live-news/world-series-dodgers-blue-jays-11-01-25": {
    "url": "https://www.cnn.com/sport/live-news/world-series-dodgers-blue-jays-11-01-25",
    "summary": "The Los Angeles Dodgers won the 2025 World Series, defeating the Toronto Blue Jays in a dramatic Game 7. Toronto took an early lead, but the Dodgers battled back, with key home runs from Miguel Rojas in the 9th and Will Smith in the 11th inning ultimately securing the victory. Pitcher Yoshinobu Yamamoto was named World Series MVP for his outstanding performance. The Dodgers are the first team to win back-to-back World Series since 1998-2000.",
    "translation": "video/output_9b1a523571.mp4",
    "translation_lang": "ASL"
  },
  "https://www.youtube.com/watch?v=8S0FDjFBj8o": {
    "url": "https://www.youtube.com/watch?v=8S0FDjFBj8o",
    "summary": "The speaker satirizes TED Talks by admitting upfront that they have nothing to say, yet will use common speaking techniques like hand gestures, personal anecdotes, and random data/graphs to create the illusion of insightful and impactful content. They highlight the absurdity of the formulaic approach, proving how easily an audience can be manipulated into believing they've learned something even when presented with utter nonsense. The speaker essentially demonstrates how to give a convincing talk without actually having anything to say.\n",
    "translation": "Other,audio/translation_spanish_e17810ca8c.mp3",
    "translation_lang": "spanish"
  },
  "https://www.youtube.com/watch?v=1lm4Wlpy2wU": {
    "url": "https://www.youtube.com/watch?v=1lm4Wlpy2wU",
    "summary": "To get a YouTube video transcript:\n\n1.  Open the YouTube video.\n2.  Click the three dots next to the like/dislike buttons.\n3.  Select \"Show transcript.\"\n4.  To copy the transcript, click the three vertical dots in the transcript window and select \"Toggle timestamps\" to remove them.\n5.  Select and drag to highlight the entire transcript, right-click, and copy.\n6.  Paste the transcript wherever you need it.\n",
    "translation": "video/output_d223cf4d97.mp4",
    "translation_lang": "ASL",
    "translation_type": "ASL"
  },
  "https://www.cnn.com/2025/11/01/us/portland-national-guard-deployment-trial": {
    "url": "https://www.cnn.com/2025/11/01/us/portland-national-guard-deployment-trial",
    "summary": "A federal judge is expected to rule soon on the legality of National Guard deployments to Portland to protect an ICE facility, after a trial highlighted the following key points:\n\n*   National Guard troops were deployed to the facility even after a judge issued a restraining order against it, raising questions of contempt.\n*   ICE officials were not consulted before Trump ordered the deployment.\n*   There's a disagreement on whether the protests are extreme enough to warrant the National Guard, with the city arguing local law enforcement can handle it and that federal tactics exacerbate the situation.\n*   Portland Police highlighted a different use of force from federal agents who deployed munitions when local law enforcement did not believe it necessary.\n*   The Trump administration argued the deployment is necessary due to the persistent and organized violence directed at the facility.\n*   Local officials claimed that National Guard was inflaming tensions and violating Oregon sovereignty.\n*   The decision is expected by Sunday and will likely be appealed.",
    "translation": "video/output_e74ef6b4e0.mp4",
    "translation_lang": "ASL",
    "translation_type": "ASL"
  },
  "https://www.cnn.com/2025/11/02/politics/democrats-shutdown-politics": {
    "url": "https://www.cnn.com/2025/11/02/politics/democrats-shutdown-politics",
    "summary": "美国有线电视新闻网报道称，民主党人目前正在“赢得”围绕政府关门的政治斗争，这主要是由于公众认为特朗普和共和党人应该承担更多责任。民主党人正在要求延长广受欢迎的奥巴马医改补贴，而共和党人的行动，如解雇联邦工作人员和潜在的食品券削减，似乎适得其反。此次关门也团结了一些民主党人的支持，表明民主党人没有多少让步的动机，特别是由于他们的选民希望他们更加努力地对抗特朗普政府。",
    "translation": "audio/translation_chinese_ca8d0395b1.mp3",
    "translation_lang": "chinese",
    "translation_type": "Other"
  },
  "https://devpost.com/hackathons": {
    "url": "https://devpost.com/hackathons",
    "summary": "Devpost es una plataforma para hackatones, que ofrece eventos tanto públicos como privados (específicos de la empresa). Ayuda a los desarrolladores a participar en hackatones y a las empresas a organizarlos, fomentando la innovación, la colaboración y la promoción de la plataforma. Recursos como blogs, historias de clientes, guías de planificación, seminarios web y un servicio de asistencia técnica están disponibles para apoyar experiencias de hackatón exitosas.",
    "translation": "audio/translation_spanish_ea99e118da.mp3",
    "translation_lang": "spanish",
    "translation_type": "Other"
  }
}